{"/website/drawings/":{"data":{"":" 20250116.png 20250124.png 20250203.png 20250415.png 20250420.png 20250513_2.png "},"title":"Drawings"},"/website/personal/on_dutch_immigration_policy/":{"data":{"the-freeze-of-asylum-requests-from-syrian-refugees#The freeze of asylum requests from Syrian refugees":"on December 9th 2024, ….I still need to finish this.","the-motion-becker#The motion Becker":"If you know me, you know that I generally refrain from having opinions on topics that I do not know much about. However, with the recent shift of power in the Dutch government towards right-wing populist (and openly racist) parties, I feel that some of the values I care about are under pressure. I talked about this topic with some colleagues (during Christmas dinner, after a few glasses of wine), and wanted to share some of my concerns with you.\nI find it difficult to articulate my general feeling of uneasiness. Instead, I chose two to highlight two developments that worry me.\nThe motion Becker The freeze of asylum requests from Syrian refugees one single day after the fall of Assad’s regime The motion BeckerThe motion (defition) Becker requests the government “… to collect data about cultural/religious values of Dutch citizens with a migration background, for example by asking {institution} to (periodically) carry out this investigation”\nI have several issues with the framing of this motion:\nIt is unconstitutional, because it does not treat all those that reside in the Netherlands as equal. While I do agree that collecting census data may help to improve the integration process, I do not think any laws should be framed around targeting specific parts of the population. This sends a message of division to both native and immigrated inhabitants of the Netherlands. It is ambiguous*, and therefore susceptible to abuse of power by either current or future governments. Even though I believe Becker’s idea may be well intended (which I do believe watching her reaction to the backlash), allowing these kinds of laws Only after the motion passed parliament, it gained a decent amount of negative attention in the media. In response, some parties withdrew their support for the motion (perhaps more out of fear for losing their voters than out of genuine understanding and regret).\n* The motion does not mention any restrictions towards what kind of data should be collected, that privacy will be protected, or who “people with a migration background” are. I understand that a motion should not go too much into detail, but still, I would expect some mention of limitations towards the collection process."},"title":"On Dutch immigration policy"},"/website/personal/sleepwalking/":{"data":{"":"Things I did or said while sleepwalking:\nSay “miauw miauw miauw” (cat sounds) Try to get into someone else’s sleeping bag (while they were sleeping inside it) Attacking my girlfriend because I thought she was a witch “There’s a fire, we have to go” Try to clean my imaginary kitesurf equipment “Stop the boat!” Opening the curtains because I saw Santa Klaus Flicking a light switch on and off many times in the kitchen "},"title":"Sleepwalking"}}